tap "caarlos0/tap"
tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "mongodb/brew"
tap "railwaycat/emacsmacport"
tap "stripe/stripe-cli"

brew "coreutils"
brew "curl"
brew "dif-so-fancy"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-filter-repo"
brew "gnu-sed"
brew "gnu-tar"
brew "grep"
brew "make"
brew "neovim"
brew "node@22"
brew "pipx"
brew "powerlevel10k"
brew "python@3.12"
brew "terminal-notifier"
brew "tmux"
brew "watchman"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "caarlos0/tap/timer"
brew "stripe/stripe-cli/stripe"

cask "alacritty"
cask "alt-tab"
cask "codex"
cask "font-jetbrains-mono"
cask "font-meslo-lg-nerd-font"
cask "iina"
cask "youtube-music"
